---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.FailedUpdateCurveChain
source: html/00eff26a-414c-e0f0-4849-c815a733d0af.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.FailedUpdateCurveChain Property

Failed to update curve chain.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedUpdateCurveChain { get; }
```